In [2]:
import pandas as pd

### creating 2 d list

In [5]:
two_Dlist=[[(columns+1) for columns in range(5)] for rows in range(4)]   
two_Dlist

[[1, 2, 3, 4, 5], [1, 2, 3, 4, 5], [1, 2, 3, 4, 5], [1, 2, 3, 4, 5]]

## Creating DF using 2d list

### way1---> pd.DataFrame()
pd.DataFrame(list_name,columns=['col1','col2'])
or
pd.DataFrame(data=list_name,columns=['col1','col2'])
or
pd.DataFrame(data=list_name,columns=['col1','col2'],dtype=None)

In [31]:
DF=pd.DataFrame(two_Dlist,columns=['a','b','c','d','e'])
DF

   a  b  c  d  e
0  1  2  3  4  5
1  1  2  3  4  5
2  1  2  3  4  5
3  1  2  3  4  5

In [33]:
DF2=pd.DataFrame(data=two_Dlist,columns=['f','g','h','i','j'])
DF2

   f  g  h  i  j
0  1  2  3  4  5
1  1  2  3  4  5
2  1  2  3  4  5
3  1  2  3  4  5

In [34]:
DF2=pd.DataFrame(data=two_Dlist,columns=['f','g','h','i','j'])
DF2.dtypes

f    int64
g    int64
h    int64
i    int64
j    int64
dtype: object

In [35]:
Df3=pd.DataFrame(data=two_Dlist,columns=['f','g','h','i','j'],dtype='str')
Df3.dtypes

f    object
g    object
h    object
i    object
j    object
dtype: object

### way2-->pd.DataFrame.from_records(data,columns=None)

pd.DataFrame.from_records(data,columns=None)

Convert structured or record ndarray to DataFrame.

Creates a DataFrame object from a structured ndarray, sequence of
tuples or dicts, or DataFrame.

In [12]:
DF3=pd.DataFrame.from_records(DF2)
DF3

C:\Users\soumy\AppData\Local\Temp\ipykernel_4736\1748476276.py:1: FutureWarning: Passing a DataFrame to DataFrame.from_records is deprecated. Use set_index and/or drop to modify the DataFrame instead.
  DF3=pd.DataFrame.from_records(DF2)

   f  g  h  i  j
0  1  2  3  4  5
1  1  2  3  4  5
2  1  2  3  4  5
3  1  2  3  4  5

In [13]:
column=['first','sec','third','fourth','five']

In [14]:
DF4=pd.DataFrame.from_records(data=two_Dlist,columns=column)
DF4

   first  sec  third  fourth  five
0      1    2      3       4     5
1      1    2      3       4     5
2      1    2      3       4     5
3      1    2      3       4     5

### way3

### pd.DataFrame.from_dict()

pd.DataFrame.from_dict(
    data: 'dict',
    orient: 'FromDictOrient' = 'columns',
    dtype: 'Dtype | None' = None,
    columns: 'Axes | None' = None,
) -> 'DataFrame'
Construct DataFrame from dictionary.

In [20]:
my_dic={'name':['soumya','shrishti','vihan'],
        'age': [23,18,14],
        'EDU':['College','School','School']
       }

In [29]:
df=pd.DataFrame.from_dict(my_dic)
df.dtypes

name    object
age      int64
EDU     object
dtype: object

In [28]:
df1=pd.DataFrame.from_dict(my_dic,dtype=str)
df1.dtypes

name    object
age     object
EDU     object
dtype: object

In [36]:
df1

       name age      EDU
0    soumya  23  College
1  shrishti  18   School
2     vihan  14   School

#### converting list to dict and then using from_dict and passing dict to create a dF object

In [37]:
two_Dlist

[[1, 2, 3, 4, 5], [1, 2, 3, 4, 5], [1, 2, 3, 4, 5], [1, 2, 3, 4, 5]]

In [38]:
column=['first','sec','third','four','five']

In [42]:
dict(zip(column,two_Dlist))

{'first': [1, 2, 3, 4, 5],
 'sec': [1, 2, 3, 4, 5],
 'third': [1, 2, 3, 4, 5],
 'four': [1, 2, 3, 4, 5]}

In [44]:
df=pd.DataFrame.from_dict(dict(zip(column,two_Dlist)))
df

   first  sec  third  four
0      1    1      1     1
1      2    2      2     2
2      3    3      3     3
3      4    4      4     4
4      5    5      5     5

In [46]:
tuple(zip(*two_Dlist))

((1, 1, 1, 1), (2, 2, 2, 2), (3, 3, 3, 3), (4, 4, 4, 4), (5, 5, 5, 5))

In [47]:
df=pd.DataFrame.from_dict(dict(zip(column,zip(*two_Dlist))))
df

   first  sec  third  four  five
0      1    2      3     4     5
1      1    2      3     4     5
2      1    2      3     4     5
3      1    2      3     4     5